tutorials/cfdemSolverVoF/waterLevelFluidizedBed/VOF-DEMFluidizedBed/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           0.1;
maxAlphaCo      0.1;

maxDeltaT       1;

libs (   
         "libfvOptionsCFDEM.so" 
         "libsimpleFunctionObjects.so"
         "libsimpleSwakFunctionObjects.so" 
     );
	 
functions
{
	bubbleVelocity
	{
			type         swakExpression;
			valueType    internalField;
            verbose      false;
			aliases     {alphaW alpha.water;}
			variables    (
			               "thres=0.5;"
						   "gasVol=sum(alphaW<=thres ? vol() : 0);"
						   "Ub=alphaW<=thres ? U.x : 0;"
						 );
			expression   "Ub*vol()/gasVol";
			accumulations (sum);
			outputControlMode timeStep;
			outputInterval 10;
	}
	gasVolume
	{
	    $bubbleVelocity;
		expression "alphaW*vol()";
		accumulations (sum);
		outputControlMode timeStep;
		outputInterval 10;
	}
}


// ************************************************************************* //
