tutorials/cfdemSolverVoF/waterLevelFluidizedBed/VOF-DEMFluidizedBed/CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 0;

boundaryField
{
    inlet
    {
		type            fixedFluxPressure;
        value           uniform 0;
    }
	
	outlet
    {
        type            fixedValue;
		value           uniform 0;
    }
	
    walls
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
