tutorials/cfdemSolverVoF/waterLevelFluidizedBed/VOF-DEMFluidizedBed/CFD/0/alphaHeavy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphaHeavy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
		type            zeroGradient;
    }
	
    outlet
    {
        type            zeroGradient;
    }
	
    walls
    {
        type            zeroGradient;
    }
	
	frontAndBackPlanes
	{
	    type empty;
	}
}

// ************************************************************************* //
